---
kind: type
id: T:Autodesk.Revit.DB.UV
source: html/1724be37-059b-91ff-aa74-d1508082f76d.htm
---
# Autodesk.Revit.DB.UV

Object representing coordinates in 2-dimensional space.

## Syntax (C#)
```csharp
public class UV
```

## Remarks
Usually this means parameters on a surface. In actual use, it could be
interpreted as either point or vector in 2-dimensional space.